import styled from "styled-components";

const Container = styled.div`
	width: 85%;
	padding: 2rem;
	margin: 3rem 7.5%;
	border: 1px solid var(--text-grey);
	border-radius: 10px;
	h2 {
		text-align: center;
		color: var(--green);
	}
	p {
		font-size: var(--text-s);
		text-align: center;
		max-width: 95ch;
		margin: 1rem auto;
	}
`;

const AboutUs = () => {
	return (
		<Container>
			<h2>{"درباره ما"}</h2>
			<p>
				{
					"متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
				}
			</p>
		</Container>
	);
};

export default AboutUs;
