import styled from "styled-components";
import { ReactComponent as HistoryLogo } from "../asset/svg/history.svg";

const Container = styled.div`
	padding: 3rem 7.5%;
	width: 100%;
`;
const Title = styled.div`
	display: flex;
	align-items: center;
	svg {
		height: 52px;
		margin-left: 0.5rem;
	}
	h2 {
		color: var(--green);
	}
`;
const Desc = styled.div`
	font-size: var(--text-s);
	p {
		margin-top: 0.5rem;
		color: var(--text);
		:first-child {
			margin-top: 1rem;
		}
	}
	h4 {
		margin-top: 1rem;
	}
`;

const History = () => {
	return (
		<Container name="history">
			<Title>
				<HistoryLogo />
				<h2>{"تاریخچه اختراع و منابع مورد تحقیق"}</h2>
			</Title>
			<Desc>
				<p>{`برای درمان مشکلات گوش در طب سنتی سرخپوستان از برگهای ذرت آغشته به ماده سوختنی، لوله کردن و آتش زدن آن استفاده می شد. با مطالعاتی که در طب سنتی ابوعلی سینا و جرجانی داشتیم متوجه خواص موم زنبور عسل در درمان بسیاری از بیماریها از جمله گوش شدیم.
در ادامه مطالعات به نتایج پزشکان روس در سال 1973 بر روی 382 بیمار مبتلا به امراض مختلف گوش و نقص های شنوایی با استفاده از بره موم برخورد کردیم که بعد از درمان 10 الی 12 روزه 314 بیمار بهبود شنوایی داشتند.`}</p>
				<p>
					{`در سال 1975 پاپ نیکلف در بلغارستان گزارش داد که توانسته است با بره موم چرک داخل گوش در 40 بیمار را درمان کند. شنوایی در اکثر بیماران بهبود یافته و در 80 درصد بیماران ترشح چرک متوقف شد و بوی بد آنها کاهش یافت.`}
				</p>
				<p>{`بین سالهای 1968 تا 1973 پزشکان روس گزارش دادند که موفق شده اند 68 بیمار مبتلا به التهاب گوش درونی را با عصاره الکلی بره موم درمان کنند و 94 درصد درمان موفقیت آمیز بوده است.`}</p>
				<h4>{"تحقیقات ابوعلی سینا و حکیم سید اسماعیل جرجانی"}</h4>
				<p>{`حکیم ابوعلی سینا در کتاب قانون یک در بخش مفردات درباره عسل، موم، بره موم و خواص آنها چنین می نویسد: « موم نرمش دهد قرحه را، از چرک و پلیدی می آکند و از انجا که می چسبد و سوراخها را می بندد و نمناکی عارض میدهد، موم در همه مرحمهای سردی بخش و گرمی دهنده وارد است.`}</p>
				<p>
					{"موم سیاه "} <strong>{"قوت جاذبه ای"}</strong>
					{
						" دارد که میتواند پیکان و خارها را از ژرفا بیرون بکشد، لطیف است، کمی پالاینده و بسیار نرم کننده است. در درمان"
					}
					<strong>{" ورم و جوش "}</strong>
					{"، ورم سخت را نرم کند، کبره را نرم کند، قرحه را از پلیدی بزداید."}
				</p>
				<p>
					<strong>{"دکتر آگارد "}</strong>
					{
						"کاشف بره موم که بیش از 20 سال سابقه فعالیت درباره خواص بره موم دارد نظریه ابوعلی سینا را تایید میکند."
					}
				</p>
				<p>
					{"به گفته "}
					<strong>{"حکیم سید اسماعیل جرجانی "}</strong>
					{` که در بخش آخر جلد دوم الاغراض در قسمت لغت نامه که به کوشش محقق کتاب دکتر حسن تاج بخش تهیه گردیده درباره عسل و موم چنین آمده:
« موم سپید دیوار خانه مگس انگبین است. موم سیاه وسخ ملوی گاه و پایگاه اوست. موم سپید معتدل است و نرم کننده، موم سیاه خار و پیکان بیرون آرد و موم در جمله پزاننده است و به اندازه گرم کند و در او تحلیلی اندک است. »`}
				</p>
				<p>
					{
						"امروزه به دلیل شناخت خواص بیشمار این ماده در موارد پزشکی از قبیل آثار ضد باکتریایی، ضد قارچی، ضد انگلی، آنتی اکسیدان، ضد التهاب، ضد پوسیدگی دندان، آسیبهای عضلانی و آرتروز به کار گرفته میشود."
					}
				</p>
				<p>
					{"در تحقیقات بعدی که به طب سنتی اسلامی پرداختیم به نظریات "}
					<strong>{"استاد حسین معارفی "}</strong>
					{
						"برخوردیم. وی خواص ضد قارچ و درمانی بره موم در برابر 17 نوع قارچ و همچنین تحقیقات علمی محققین چک در سال 1975، لهستان در سال 1977، جمهوری فدرال آلمان زاگرب در سال 1982 و محققان زیبایی در سال 1987 پرداخته و نتایجی مبنی بر اثرات بره موم روی انواع قارچ و همینطور چهار نوع خاص قارچها که باعث بروز عفونت در انسان میشود را ثبت نموده است.  "
					}
				</p>
				<h4>{"منابع تحقیق"}</h4>
				<ul>
					<li>{`طلوع بهداشت، اسلام مرادی اصل، حسن وطن دوست، مهدی سالاری جوزم، جواد رفیع نژاد (فصل نامه علمی پژوهشی دانشکده بهداشت یزد مورخ 7/6/1390)`}</li>
					<li>
						{`خواص مواد غذایی، خواص موم زنبور عسل www.amirasal111.com//indexthd -  YOUTAB   `}
						<br />
						{`بره موم عسل انتی بیوتیکی بسیار قوی، دکتر حسین معارفی، 13 مرداد 1396  www.tajatobteb.ir`}
					</li>
				</ul>
			</Desc>
		</Container>
	);
};

export default History;
